We got our serotonin blast
Yab yum (or yummy yummy as I like to call it)
hi loves! love stream from me above from mexico city art realms and a special
The next one is thu-Sunday April 25-28 somewhere a few hours south of the Bay Area in CA.
ahh you are a true artist water priestess!!!! so proud of YOU
here now… planting all intentions shared and and more that flow my way in next hour…
Many in this thread have attended at least one and can provide their own perspective.
love you. makes me smile in a way i didnt know possible.
I said goodbye in my fire breathing coffin
They let strangers into our hotel resort!?
that is cool!
…and between now and Raj’s microburn, here’s a link to a collaborative Spotify playlist any of us can add tracks to. I seeded it with a couple of obvious ones . Add any tracks you feel evoke memories and feelings of the extraordinary experience we just shared!
And listen to Dr. Po’s seratonin prescription!
that was our morning meditation!
The Fanny pack!!
The amount of serendipity that’s been happening around this event is ridiculous. Cristine went to the post office and they were playing the Backstreet Boys song the last boat did. Arrrrgh.
⁠eye gazing in yab yum while exchanging ‘I love your __.’
Josh and Jess, thank you SO much for including me and Robb in this incredible experience. We loved the adventure and being around you two to watch your vows and seal your nuptials with EPIC celebrations. Wishing you health and happiness forever. To the Felser-Scorpios!!
Added some too
Tysm!  I miss seeing your fanny pack!
Good vibes, addictive Grooves & BIG Basslines ;) \o/
You are a rocket ship going to your best self
adding eye gazing next time
I set up a shared Google photos album. Do not share the link with anyone who didn’t attend the wedding. When everyone joins with this link I am going to lock it down. Please don’t share every photos just your best photos. Share away my loves and let’s keep reliving the memories.
Nothing will re-create this magical event we experienced...
Also! i am going to the sun and moon pyramids of teotihuacan tomorrow— dm me if you want me to beam an intention from you while there!
However - there is an experience that is quasi-similar coming up….
Seratonin balancing indeed
Thanks to all the happy faces who stayed up all night or who set their dusty alarm clocks to come and dance with us Wednesday morning. Having been on the other side of the speakers for many a sunrise
I literally played this version of the song all day!
Sending you so much love Maya as you complete this incredible life chapter and initiate your next service. Po - I love this invitation and will put thought into my transmission.
Seretonin reuptake for you all…
Here’s to a new beginning
2. Eye gaze w self in mirror.
Astro, after me and said here’s to new beginnings when he came out
Jess/Josh, how does one say thank you for such a magnificent gift of having us in your life and for this weekend - other than to say “I do” to being in your lives, to supporting you through your love in every moment - I’m here for you for all of it; reach out in the hard times and in the easy times I am here for you.
It would be lov… Read more
Oliver Heldens feat. Nile Rodgers & House Gospel Choir - I Was Made For Lovin' You
@~Maya Jaguar rev  sending you so much love today! So proud of you for closing this chapter and so excited for your incredible future
We love you @~~ Jessica Scorpio
dreams and intentions delivered! the individual ones and the collective of ALL of US and ours here in J2 And all of humanity, the earth, stars and far beyond…
Incredible Po! So appreciate you carrying us up the pyramids with you. I feel connected to you and the power of the place.
And also…Here’s the Fleetmac Wood set I played before Eduardo.  This song included and more….so much Fleetwood.  Yay!
When I was I. The UPS store this evening the no talent show Backstreet Boys song was playing! No coincedences.
Well said, Seth!
Just posted some photos and videos! If you posted videos/photos here in the chat, please add to the google photo album so we can see it full resolution!
2 minutes a day does ALOT!
rx for the seratonin-seeking among us! @~Maya Jaguar thank you for those potent Prayers!
So freakin grateful for all of you!!!
Fleetmac Wood - Robot Heart 10 Year Anniversary - Burning Man 2017
This message was deleted
True story - The moon pyramid is where I nearly fell from the top as a child and was caught and saved on a rickety barbed wire ( I don’t think they allow people to climb them anymore).
LOVE YOU ALL MUCHO
This just happened!!!!
I do xxxx birthday girl xxx
This story about Coyolxauhi was transmitted to me by one of the women who organises the “moon dance” tradition in Tulum where hundreds of women gather to pray, dance and fast for several days
Yes please. Today is my last day at X.
3.  Eye gaze w self in mirror while saying ‘I love you.’
Myself and a few others created ‘microburns’ during the pandemic.   3 day weekends in nature where we dive into deep connection, art, dance, music, talks, cuddle puddles, and joy - along with vulnerable moments of tears and love.    Mini burning mans without a lot of the hardship (food provided but you do camp in an rv or tent)
i got you!!!
U did it maya - now on to the next chapter my Leo power house
These are volunteer run like the burn and not for profit.  Think of it as camping with a serotonin high : )
Still a glow from Mexico!  Cherishing this amazing group that Josh and Jess brought together.  So authentic and filled with love!
transformational growth and expansion for the collective, my miami community, divine guidance, overflowing abundance!
It was such a treat to be ensconced in the Joshica friendmoon bubble. Everyone was so friendly and cool
and if you want to stream it https://soundcloud.com/oliverheldens/oliver-heldens-feat-nile?utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing
Friendmoon Dreams · Playlist · 2 songs
WOW!!! Thank you my sister!
The ancient Mexican Aztec goddess of the moon, Coyolxauhi was dismembered and stripped of her powers. The allegory represents the story of modern women; the wholeness we are looking for within the divine feminine represents the re-unification of our feminine powers.
The Miami crew were the last to leave the hotel. Imagine my surprise when we went to the lagoon area to hang out and there were - !strangers! there. Yes, new guests had checked in. It’s as if the weekend was a dream.
This captures the joy and love and magic that came from the heavens and this community to bless you Jess & Josh, bless your love, bless your union.  Literally showering you with pearls and diamonds of light and love.  What a joyous loving life you have created - inner and outer! (I’ll post a longer clip in the g-drive).
Love and miss you two and all of you.
Now we’re partying with lots of tequila
eye gazing while sitting in yab yum. (Image below)
And here is the track Jason played before it started raining
I loved asking each person how they knew Josh or Jess and hearing their origin stories.
Click here to get older messages from your phone.
Obsessed w you, Maya!!
1. Eye gaze w friend from wedding (works on zoom and FT!)
Meeee to thank you magnificent @~Po
Integration homework suggestions for anyone interested!
And you know this track
“Bacalar! Bacalar! It’s sexy and it’s hot…”
01 I Was Made For Lovin' You (Extended).mp3
@~Maya Jaguar - Sending you so much love. I hope that today feels good and that you’re holding yourself and being held by others in deep love, grace, and gratitude for this moment. And may you feel the full expansion of your being in this move! Love you.